app/views/favorites/_favorite.html.erb

		<p><%= link_to book_favorites_path(book.id), method: :delete, remote:true do %><%= content_tag :span, "", class: "glyphicon glyphicon-heart" %>
			<%= book.favorites.count %></p>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

			<%= link_to book_favorites_path(book.id), method: :post, remote: true do %><%= content_tag :span, "", class: "glyphicon glyphicon-heart-empty" %>
			<%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 3]]