app/views/books/index.html.erb

									<%= content_tag :span, "", class: "glyphicon glyphicon-heart" %>
									<%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

									<i class="fa fa-heart-o" aria-hidden="true"></i>
									<%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

						<td><!-- コメント機能 -->
							<%= link_to "#{book.post_comments.count}コメント",book_path(book.id)%>
---
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 1]]