app/views/books/show.html.erb

									<%= content_tag :span, "", class: "glyphicon glyphicon-heart" %>
									<%= @bookdetail.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

									<i class="fa fa-heart-o" aria-hidden="true"></i>
									<%= @bookdetail.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

						<td><!-- コメントカウント機能 -->
							<a>コメント数：<%= @bookdetail.post_comments.count %></a>
---
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 1]]

			<table class="table">
				<% @bookdetail.post_comments.each do |post_comment| %>
---
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 1]]