app/controllers/books_controller.rb

  def show
  	@bookdetail = Book.find(params[:id])
    @book = Book.new
    @user = User.find(@bookdetail.user_id)
    @post_comment = PostComment.new
    @post_comments = PostComment.all
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 1]]

  def create
  	@book = Book.new(book_params) #Bookモデルのテーブルを使用しているのでbookコントローラで保存する。
    @book.user_id = current_user.id
  	if @book.save #入力されたデータをdbに保存する。
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "テスト"], ["body", "投稿しました"], ["user_id", 2], ["created_at", "2020-03-05 07:07:53.551704"], ["updated_at", "2020-03-05 07:07:53.551704"]]