app/controllers/favorites_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["book_id", 1], ["created_at", "2020-03-03 06:32:54.662024"], ["updated_at", "2020-03-03 06:32:54.662024"]]
---
	def create
		book = Book.find(params[:book_id])
		favorite = current_user.favorites.new(book_id: book.id)
		# 上の記述と同じ効果
		# favorite = Favorite.new(user_id: current_user.id, book_id: @book.id)
		favorite.save