app/controllers/post_comments_controller.rb

	def create
		book = Book.find(params[:book_id])
		comment = current_user.post_comments.new(post_comment_params)
		# この書き方でも同じ効果があります
		# comment = Post_comment.new(post_comment_params)
		# comment.user_id  =  current_user.id
		comment.book_id = book.id
		comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "post_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "テスtp\r\n"], ["user_id", 1], ["book_id", 1], ["created_at", "2020-03-04 03:25:39.437400"], ["updated_at", "2020-03-04 03:25:39.437400"]]

	def destroy
		@post_comment = PostComment.find(params[:book_id])
		@post_comment.destroy
---
SELECT  "post_comments".* FROM "post_comments" WHERE "post_comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "post_comments" WHERE "post_comments"."id" = ?  [["id", 1]]