app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", "Hi"], ["profile_image_id", "d59cf7e6864240891cecba7b10f4402dfa044d0b167004af83a9e8611caf"], ["updated_at", "2020-03-06 10:11:27.659031"], ["id", 4]]
---
  def update
  	@user = User.find(params[:id])
  	if @user.update_attributes(user_params)